#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azurerm_app_service.appservicedemo1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_app_service" "appservicedemo1" {
      [32m+[0m [0m[1m[0mapp_service_plan_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mapp_settings[0m[0m                      = {
          [32m+[0m [0m"SOME_KEY" = "some-value"
        }
      [32m+[0m [0m[1m[0mclient_affinity_enabled[0m[0m           = false
      [32m+[0m [0m[1m[0mclient_cert_enabled[0m[0m               = false
      [32m+[0m [0m[1m[0mcustom_domain_verification_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mdefault_site_hostname[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                           = true
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                        = false
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_reference_identity_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "centralus"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "hiiraldemoappservice"
      [32m+[0m [0m[1m[0moutbound_ip_address_list[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_address_list[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "azureesourcegroup1"
      [32m+[0m [0m[1m[0msite_credential[0m[0m                   = (known after apply)

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_params[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m     = (sensitive value)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m   = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m = (sensitive value)
            }
        }

      [32m+[0m [0mconnection_string {
          [32m+[0m [0m[1m[0mname[0m[0m  = "Database"
          [32m+[0m [0m[1m[0mtype[0m[0m  = "SQLServer"
          [32m+[0m [0m[1m[0mvalue[0m[0m = (sensitive value)
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0midentity_ids[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mlogs {
          [32m+[0m [0m[1m[0mdetailed_error_messages_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mfailed_request_tracing_enabled[0m[0m  = (known after apply)

          [32m+[0m [0mapplication_logs {
              [32m+[0m [0m[1m[0mfile_system_level[0m[0m = (known after apply)

              [32m+[0m [0mazure_blob_storage {
                  [32m+[0m [0m[1m[0mlevel[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msas_url[0m[0m           = (sensitive value)
                }
            }

          [32m+[0m [0mhttp_logs {
              [32m+[0m [0mazure_blob_storage {
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msas_url[0m[0m           = (sensitive value)
                }

              [32m+[0m [0mfile_system {
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mretention_in_mb[0m[0m   = (known after apply)
                }
            }
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0macr_use_managed_identity_credentials[0m[0m = false
          [32m+[0m [0m[1m[0malways_on[0m[0m                            = false
          [32m+[0m [0m[1m[0mdotnet_framework_version[0m[0m             = "v4.0"
          [32m+[0m [0m[1m[0mftps_state[0m[0m                           = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m                        = false
          [32m+[0m [0m[1m[0mip_restriction[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mjava_version[0m[0m                         = "11"
          [32m+[0m [0m[1m[0mlinux_fx_version[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mlocal_mysql_enabled[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mmanaged_pipeline_mode[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mmin_tls_version[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mnumber_of_workers[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_enabled[0m[0m             = false
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mscm_ip_restriction[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mscm_type[0m[0m                             = "LocalGit"
          [32m+[0m [0m[1m[0mscm_use_main_ip_restriction[0m[0m          = false
          [32m+[0m [0m[1m[0mvnet_route_all_enabled[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mwindows_fx_version[0m[0m                   = (known after apply)

          [32m+[0m [0mcors {
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0msupport_credentials[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0msource_control {
          [32m+[0m [0m[1m[0mbranch[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mmanual_integration[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mrepo_url[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mrollback_enabled[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0muse_mercurial[0m[0m      = (known after apply)
        }

      [32m+[0m [0mstorage_account {
          [32m+[0m [0m[1m[0maccess_key[0m[0m   = (sensitive value)
          [32m+[0m [0m[1m[0maccount_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmount_path[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mshare_name[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }
    }

[1m  # azurerm_app_service_plan.appserviceplandemo1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_app_service_plan" "appserviceplandemo1" {
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                         = "Linux"
      [32m+[0m [0m[1m[0mlocation[0m[0m                     = "centralus"
      [32m+[0m [0m[1m[0mmaximum_elastic_worker_count[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmaximum_number_of_workers[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "hiraldemoappserviceplan"
      [32m+[0m [0m[1m[0mreserved[0m[0m                     = true
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "azureesourcegroup1"

      [32m+[0m [0msku {
          [32m+[0m [0m[1m[0mcapacity[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msize[0m[0m     = "S1"
          [32m+[0m [0m[1m[0mtier[0m[0m     = "Standard"
        }
    }

[1m  # azurerm_resource_group.resource1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource1" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "centralus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "azureesourcegroup1"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"environment" = "Dev"
          [32m+[0m [0m"owner"       = "Hiral"
          [32m+[0m [0m"purpose"     = "AzureTfDemo"
        }
    }

[1m  # azurerm_storage_account.storage[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "storage" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                     = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m         = "GRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0mallow_blob_public_access[0m[0m         = false
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m        = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                   = false
      [32m+[0m [0m[1m[0mlarge_file_share_enabled[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                         = "centralus"
      [32m+[0m [0m[1m[0mmin_tls_version[0m[0m                  = "TLS1_0"
      [32m+[0m [0m[1m[0mname[0m[0m                             = "azurestoragegrouphiral"
      [32m+[0m [0m[1m[0mnfsv3_enabled[0m[0m                    = false
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m               = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m              = "azureesourcegroup1"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mshared_access_key_enabled[0m[0m        = true
      [32m+[0m [0m[1m[0mtags[0m[0m                             = {
          [32m+[0m [0m"environment" = "Dev"
          [32m+[0m [0m"owner"       = "Hiral"
          [32m+[0m [0m"purpose"     = "AzureTfDemo"
        }

      [32m+[0m [0mblob_properties {
          [32m+[0m [0m[1m[0mchange_feed_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdefault_service_version[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mlast_access_time_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mversioning_enabled[0m[0m       = (known after apply)

          [32m+[0m [0mcontainer_delete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0midentity_ids[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)

          [32m+[0m [0mprivate_link_access {
              [32m+[0m [0m[1m[0mendpoint_resource_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mendpoint_tenant_id[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }

      [32m+[0m [0mrouting {
          [32m+[0m [0m[1m[0mchoice[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mpublish_internet_endpoints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpublish_microsoft_endpoints[0m[0m = (known after apply)
        }

      [32m+[0m [0mshare_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mretention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0msmb {
              [32m+[0m [0m[1m[0mauthentication_types[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mchannel_encryption_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mkerberos_ticket_encryption_type[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversions[0m[0m                        = (known after apply)
            }
        }
    }

[1m  # azurerm_storage_container.storagecontainer[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storagecontainer" {
      [32m+[0m [0m[1m[0mcontainer_access_type[0m[0m   = "private"
      [32m+[0m [0m[1m[0mhas_immutability_policy[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mhas_legal_hold[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                    = "example"
      [32m+[0m [0m[1m[0mresource_manager_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_name[0m[0m    = "azurestoragegrouphiral"
    }

[0m[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mappservice[0m[0m        = (known after apply)
  [32m+[0m [0m[1m[0mappserviceplan[0m[0m    = (known after apply)
  [32m+[0m [0m[1m[0mcontainer[0m[0m         = "example"
  [32m+[0m [0m[1m[0mresourcegroupid[0m[0m   = (known after apply)
  [32m+[0m [0m[1m[0mresourcegroupname[0m[0m = "azureesourcegroup1"
  [32m+[0m [0m[1m[0mstorageaccount[0m[0m    = "azurestoragegrouphiral"
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mVersion constraints inside provider configuration blocks are deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on provider.tf line 2, in provider "azurerm":
[33m│[0m [0m   2:   version                    = [4m">=2.40.0"[0m[0m
[33m│[0m [0m
[33m│[0m [0mTerraform 0.13 and earlier allowed provider version constraints inside the
[33m│[0m [0mprovider configuration block, but that is now deprecated and will be
[33m│[0m [0mremoved in a future version of Terraform. To silence this warning, move the
[33m│[0m [0mprovider version constraint into the required_providers block.
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @hnair187, Action: `pull_request`*